In [3]:
import pandas as pd
import numpy as np

st1 = pd.Series({'국어':100, '영어':80,'수학':90})
st2 = pd.Series({'수학': 80, '국어':90,'영어':80})
print(st1,'\n')
print(st2)

국어    100
영어     80
수학     90
dtype: int64

수학    80
국어    90
영어    80
dtype: int64

In [10]:
# 두 학생의 과목별 점수로 사칙연산 수행. 두개 합치는거니깐 concat 사용!
add = st1 + st2
sub = st1 - st2
mul = st1 * st2
div = round((st1 / st2),2)

df = pd.concat([add,sub,mul,div], axis = 1)  # axis=1 : 열방향. concat 첫번째 인자에 있는 것들을 열에 나열
df #df.rename으로 column, index 바꿔주기 가능

      0   1     2     3
국어  190  10  9000  1.11
수학  170  10  7200  1.12
영어  160   0  6400  1.00

In [7]:
result = pd.DataFrame([add,sub,mul,div], index=['덧셈','뺄셈','곱셈','나눗셈'])
result # 이렇게 데이터프레임으로도 만들 수 있음

          국어       수학      영어
덧셈    190.00   170.00   160.0
뺄셈     10.00    10.00     0.0
곱셈   9000.00  7200.00  6400.0
나눗셈     1.11     1.12     1.0

In [8]:
np.arange(12) # 1차원

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [17]:
# 배열의 연산

np.arange(12).reshape(3,4)  # reshape(a,b) : a행b열로.
                            # reshape(a,b,c) : b행c열로 a개 생성

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [20]:
arr = np.arange(12.).reshape(3,4) # arange안에 실수로 점 찍으면 모든 값에 같이 출력
print(arr, '\n')
print(arr[0])  # 0행 전부다나옴

[[ 0.  1.  2.  3.]
 [ 4.  5.  6.  7.]
 [ 8.  9. 10. 11.]]

[0. 1. 2. 3.]

In [24]:
# 위 두개를 연산한다면?
# broadcasting. 알아서 각각에 맞춰 적용시켜줌
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [25]:
# DataFrame과 Series간 연산
frame = pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [27]:
series = frame.iloc[0]  # 첫번째 행 출력
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [33]:
frame - series # 데이터프레임과 시리즈끼리 연산 가능

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [32]:
frame + frame  # 데이터프레임끼리의 연산도 적용됨

           b     d     e
Utah     0.0   2.0   4.0
Ohio     6.0   8.0  10.0
Texas   12.0  14.0  16.0
Oregon  18.0  20.0  22.0

커스텀 함수(custom function)를 DataFrame에 적용하려면 map함수, apply함수, applymap함수를 사용
- map함수 : DataFrame 타입이 아니라, 반드시 Series 타입에서만 사용
- apply함수 : 커스텀 함수를 사용하기 위해 DataFrame에서 복수 개의 컬럼이 필요하다면, apply함수를 사용
- applymap함수 : DataFrame클래스의 함수이긴 하나, 위의 apply함수처럼 각 row(axis=1)나 각 column(axis=0)별로 
작동하는 함수가 아니라, 각 요소(element)별로 작동  
마치 선형대수에서 벡터에 스칼라를 연산하면, 벡터의 요소 하나하나에 해당 연산을 해주는 것처럼(elementwise) 
적용하는 DataFrame의 각 요소마다 커스텀 함수(반드시 Single vaule를 반환하는)를 수행한다고 보면 된다. 
applymap에 인자로 전달하는 커스텀함수가 Single value로부터 Single value를 반환한다는 점이 중요하다

In [35]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [40]:
f = lambda x : x.max() - x.min()
frame.apply(f)  # 각각의 값 적용. b c d가 각각 행방향에 있는 연산을 처리

b    9.0
d    9.0
e    9.0
dtype: float64

In [43]:
frame.apply(f,axis='columns')  # 열 기준으로 값을 바꿔줌. e - b가 된 셈

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [44]:
# 여러 값을 가진 Series 반환
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [46]:
# 아까 f는 최대-최소
def f(x) :         # 사용자 정의 함수에는 반드시 return 값 있어야함
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

#
# 이거 좋은 예문

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [50]:
# 과제 : 내가 할 수 있는 최대한 복잡한 사용자 함수를 생성한 후 df(데이터프레임)에 적용하여 결과를 출력해보세요.
# 복잡한데 유용하게. 유용가치가 있어야함

In [59]:
# format
# 소수점 둘째자리까지 만들기
format = lambda x: '%.2f' %x  # 소숫점 둘째자리라 %.2 f는 실수를 뜻함  %x : x값에 대해서
frame.applymap(format)  # applymap : 각 요소별로 작동

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [57]:
# map
#시리즈를 선택해주고(frame['e'].)
frame['e'].map(format)

Utah       2.00
Ohio       5.00
Texas      8.00
Oregon    11.00
Name: e, dtype: object